# Create & Access SQLite database using Python

##### Author: Kliz John Andrei Millares

## Objectives

In this notebook I will:

*   Create a database
*   Create a table
*   Insert data into the table
*   Query data from the table
*   Retrieve the result set into a pandas dataframe
*   Close the database connection

SQLite is a software library that implements a self-contained, serverless, zero-configuration, transactional SQL database engine. SQLite is the most widely deployed SQL database engine in the world.

## 1. Create database using SQLite

In [3]:
#Install & load sqlite3
#!pip install sqlite3
import sqlite3

In [5]:
# Connecting to sqlite
# connection object
conn = sqlite3.connect('INSTRUCTOR.db')

Cursor class is an instance using which you can invoke methods that execute SQLite statements, fetch data from the result sets of the queries. You can create Cursor object using the cursor() method of the Connection object/class.

In [6]:
# cursor object
cursor_obj = conn.cursor()

## 2. Create a table in the database

Before creating a table, I will check if the table already exists or not. To drop the table from a database, I use the **DROP** query. A cursor is an object that helps execute the query and fetch the records from the database.

In [7]:
# Drop the table if already exists.
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [9]:
#Lets create a table
table = """ CREATE TABLE IF NOT EXISTS INSTRUCTOR(
            ID INTEGER PRIMARY KEY NOT NULL,
            FNAME VARCHAR(20),
            LNAME VARCHAR(20),
            CITY VARCHAR(20),
            POSTAL_CODE CHAR(4)); 
        """

cursor_obj.execute(table)

print("Table is Ready")

Table is Ready

## 3. Insert data into the table

In [10]:
cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Kliz Andrei', 'Millares', 'Makati', '1550')''')

In [14]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Nicole', 'Duenas', 'Manila', '1104'), 
                                                    (3, 'Amiel', 'Catibay', 'Olongapo', '1225'),
                                                    (4, 'Norman', 'Santiago', 'Quezon City', '1403'),
                                                    (5, 'Leni', 'Marcos', 'Paranaque', '1206');
                                                    ''')

## 4. Query data in the table

In [17]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(1, 'Kliz Andrei', 'Millares', 'Makati', '1550')
(2, 'Nicole', 'Duenas', 'Manila', '1104')
(3, 'Amiel', 'Catibay', 'Olongapo', '1225')
(4, 'Norman', 'Santiago', 'Quezon City', '1403')
(5, 'Leni', 'Marcos', 'Paranaque', '1206')

In [18]:
## Fetch few rows from the table
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
# If you want to fetch few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor_obj.fetchmany(2) 
for row_many in output_many:
  print(row_many)

All the data
(1, 'Kliz Andrei', 'Millares', 'Makati', '1550')
(2, 'Nicole', 'Duenas', 'Manila', '1104')

In [20]:
# Fetch only First name from the table
statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output_column = cursor_obj.fetchall()
for fetch in output_column:
  print(fetch)

All the data
('Kliz Andrei',)
('Nicole',)
('Amiel',)
('Norman',)
('Leni',)

## 5. Update statement

In [21]:
query_update='''update INSTRUCTOR set CITY='Taguig' where FNAME="Kliz Andrei"'''
cursor_obj.execute(query_update)

In [24]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output1 = cursor_obj.fetchmany(3)
for row in output1:
  print(row)

All the data
(1, 'Kliz Andrei', 'Millares', 'Taguig', '1550')
(2, 'Nicole', 'Duenas', 'Manila', '1104')
(3, 'Amiel', 'Catibay', 'Olongapo', '1225')

## 6. Retrieve data into Pandas
In this step I will retrieve the contents of the INSTRUCTOR table into a Pandas dataframe

In [25]:
import pandas as pd
#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor;", conn)

#print the dataframe
df

   ID        FNAME     LNAME         CITY POSTAL_CODE
0   1  Kliz Andrei  Millares       Taguig        1550
1   2       Nicole    Duenas       Manila        1104
2   3        Amiel   Catibay     Olongapo        1225
3   4       Norman  Santiago  Quezon City        1403
4   5         Leni    Marcos    Paranaque        1206

In [26]:
#print just the LNAME for first row in the pandas data frame
df.LNAME[0]

'Millares'

In [27]:
df.shape

(5, 5)

## 7. Close the Connection

In [28]:
# Close the connection
conn.close()

## Summary

In this notebook I created a database & table in Python notebook using SQLite3. Then created a table and insert a few rows of data into it. Then queried the data. I also retrieved the data into a pandas dataframe.

<center><b>Trademark © Kliz John Millares</b></center>